{
 "title": "Hi!",
  "text": "<p>Thanks for using this little app!</p><p>I&#39;ve added some notes about the app: what my idea is with Stellenbosch Specials (or the lack thereof), features I&#39;ve just implemented as well as those on coming-soon (read: might-come-this-year) and what to do if you want to get involved.</p><p>Chrisjan</p>",
  "text_full": "<p>Thanks for using this little app! Every extra download I see on Google Play gets me excited. A simple specials app is something I&#39;ve personally wanted for quite some time and now am able to build. I doubt it&#39;ll ever make money, but to me this is more of a learning experience. One of the main things I&#39;ve learned is the value of user feedback - I often get told of simple things that provide great value in the end. And yes, I&#39;m still talking about software development.</p><h5>Some features implemented with the recent update:</h5><ul><li>Probably both the most time-consuming and most unfelt change was migrating to a DIY database. The previous one was a free service, but we&#39;ve reached the maximum usage limit (more to do with the amount of testing I&#39;ve been doing than the amount of users we have).</li><li>Minor changes to look of the main page (price tag, don&#39;t have to scroll to Sunday, choosing a day closes the menu, heading shows selected day, loading ...)</li><li>Specials description rephrased.</li><li>Small changes to special detail page (which made a big difference).</li><li>New logo, but still unsure about how permanent it will be.</li><li>This developer notice was added!</li></ul><h5>Since I love planning way too far, here is a long list of planned features:</h5><ul><li>Report an unavailable or inaccurate special</li><li>Sharing of a special over Whatsapp or such</li><li>Display map with the special details</li><li>Redo main page layout to fit more specials per screen</li><li>Show time left of each special</li><li>Allow users to add specials</li><li>Data saver setting that doesn&#39;t load images</li><li>Determine which specials to list first with a ranking algorithm for specials based on (too) many things</li><li>More filters (venue, local/franchise, type of food, time) and order by (price, time)</li><li>In-app user feedback (for now you can email me at chrisjanwust@gmail.com)</li><li>Lastly, a form in which you can vote for which feature I should implement next</li></ul><h5>Get involved</h5><p>I&#39;m looking for someone to help me with maintaining the database. Since you&#39;re read till here, you&#39;re part of the target market. It is a lot less complicated than it sounds since most of it is on a simple Google Sheet. If you&#39;re keen, let me know (<a href=\"mailto:chrisjanwust@gmail.com\">chrisjanwust@gmail.com</a>).</p><p>Also, if by any chance you&#39;re a coder reading this and (by an ever smaller chance) you&#39;d like to get involved in the project, lets talk! The 21st century isn&#39;t perfect, but it has some pretty good version control solution.</p>",
 "version" : 2
}
